{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Resume.pdf",
  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "A results-driven software engineer with <span class='underline'>3 years of experience</span> crafting high-performance, scalable web and mobile applications. Skilled in <span class='underline'>Angular, React, React Native, TypeScript, JavaScript, HTML, and CSS</span>, I bring designs to life with clean, efficient code and a deep focus on seamless user experiences. Passionate about modern front-end technologies, I constantly explore new techniques to push the limits of what's possible on the web.",
  "Banner.ActionBtn": "Get in touch",
  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "I love building web and mobile applications that are not just functional but also smooth, scalable, and visually engaging. With <span class='underline'>3 years of experience</span> in front-end development, I’ve worked extensively with <span class='underline'>React, React Native, and Angular</span> to create fast, responsive, and intuitive user interfaces. I enjoy writing clean, reusable code and optimizing performance to deliver seamless experiences across devices.",

    "Beyond front-end development, I have hands-on experience with <span class='underline'>user authentication (SSO, JWT), payment gateway integration, multi-language support, and real-time data handling.</span>",

    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Gemini",
      "Title": "Software Engineer L2",
      "Date": "April 2022 - Present",
      "Description": [
        "Developed and maintained scalable web applications, including an insurance portal, an incident management system, and a movie ticket booking platform.",
        "Optimized code efficiency by 40% for over 20 customers, enhancing application performance and user experience.",
        "Transformed Figma designs into fully responsive, user-friendly interfaces using Angular, React, and Tailwind CSS.",
        "Integrated RESTful APIs for seamless data communication and implemented authentication (SSO, JWT) for secure access control.",
        "Built an advanced incident management system from scratch, using Angular, NGRX for state management, and Chart.js for real-time data visualization.",
        "Developed key features for a movie ticket booking platform, including user authentication, seat selection, multi-language support, and payment processing.",
        "Conducted training sessions on Angular and React, helping team members upskill and boosting productivity."
      ]
    }
  ],
  "FeatureProjects.Title": "Projects that I was a part of",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Reel Cinemas",
      "Description": "Contributed to the redevelopment of a <span class='underline'>movie ticket booking platform</span>, transitioning the application from <span class='underline'>.NET to React</span> for improved scalability and modernized user experience. Developed a <span class='underline'>responsive and accessible front-end</span> with a focus on <span class='underline'>reusable components</span> and a <span class='underline'>modular architecture</span>. Implemented essential features like <span class='underline'>user authentication, seat selection, ticket booking, offers,</span> <span class='underline'>multi-language support</span> and <span class='underline'>food ordering options</span>, ensuring a seamless and engaging user journey. Integrated secure <span class='underline'>payment options</span> and optimized <span class='underline'>state management</span> with Redux for a smooth application flow.",
      "imgs": [
        "assets/images/rc/reel1.png",
        "assets/images/rc/reel2.png",
        "assets/images/rc/reel3.png",
        "assets/images/rc/reel4.png",
        "assets/images/rc/reel5.png",
        "assets/images/rc/reel6.png",
        "assets/images/rc/reel7.png"
      ],
      "Technologies": [
        "React",
        "TypeScript",
        "Tailwind CSS",
        "Material UI",
        "Redux",
        "SSO",
        "Git",
        "Azure"
      ]
    },
    {
      "Title": "Agent Portal",
      "Description": "Developed a comprehensive web application for a leading <span class='underline'>Indian insurance company,</span> featuring over <span class='underline'> 10 insurance products.</span>The portal streamlines <span class='underline'> policy issuance, renewals, endorsements, </span> and <span class='underline'>claims management.</span> Integrated <span class='underline'>CRM tools</span> for managing client interactions and leads. Led the project through <span class='underline'> design, development, testing,</span> and <span class='underline'>deployment</span> ensuring a <span class='underline'>responsive</span> and <span class='underline'> user-friendly</span> experience with key functionalities like <span class='underline'>API integration</span> and <span class='underline'>authentication.</span>",
      "imgs": [
        "assets/images/ap/agent-portal1.png",
        "assets/images/ap/agent-portal2.png"
      ],
      "Technologies": ["Angular", "SASS", "NG-Bootstrap", "TypeScript"]
    },
    {
      "Title": "Incident Management System",
      "Description": "Designed and developed a robust <span class='underline'>Incident Management System</span> to streamline real-time <span class='underline'>incident tracking, escalation, and resolution.</span> The system features <span class='underline'>on-call scheduling</span>, <span class='underline'>automated escalation policies</span>, and <span class='underline'>real-time monitoring</span> to ensure quick responses to critical events. Integrated <span class='underline'>Azure AD SSO</span> for secure authentication and implemented <span class='underline'>interactive dashboards</span> with Chart.js for data-driven insights. Built with a modular architecture for scalability and maintainability, enhancing operational efficiency.",
      "imgs": ["assets/images/ims/image1.png", "assets/images/ims/image2.png"],
      "Technologies": [
        "Angular",
        "TypeScript",
        "NGRX",
        "Chart.js",
        "Angular Material",
        "SASS",
        "Azure AD SSO",
        "Jenkins",
        "Git"
      ]
    },
    {
      "Title": "Harshit's Superstore",
      "Description": "Developed <span class='underline'>Harshit's Superstore,</span> a comprehensive <span class='underline'>e-commerce platform</span> designed to enhance online shopping experiences. The platform features <span class='underline'>dynamic product listing,</span> a <span class='underline'>product detail view,</span> and a <span class='underline'>real-time cart system,</span> allowing users to seamlessly add or remove items. Integrated <span class='underline'>search, sorting, and filtering features</span> to streamline navigation and improve user experience. Managed application state with <span class='underline'>Reducers</span> and <span class='underline'>Contexts,</span> ensuring efficient data handling and smooth performance.",
      "imgs": [
        "assets/images/hs/image1.png",
        "assets/images/hs/image2.png",
        "assets/images/hs/image3.png",
        "assets/images/hs/image4.png"
      ],
      "demoLink": "https://haryagni.github.io/E-Commerce",
      "ghLink": "https://github.com/HaryAgni/E-Commerce",
      "Technologies": [
        "React",
        "React Router",
        "JavaScript",
        "CSS",
        "HTML",
        "Reducers",
        "Contexts"
      ]
    },
    {
      "Title": "Favourite Places",
      "Description": "Developed <span class='underline'>Favourite Places,</span> a mobile app allowing users to save their favorite places with location tagging and images. Leveraged native device features such as <span class='underline'>location access</span> and <span class='underline'>camera functionality,</span> enhancing user interaction. Integrated smooth navigation between screens and ensured efficient data storage using <span class='underline'>SQLite.</span>",
      "imgs": [
        "assets/images/fp/image1.png",
        "assets/images/fp/image2.png",
        "assets/images/fp/image3.png"
      ],
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/favourite-places",
      "Technologies": [
        "React Native",
        "Expo",
        "React Navigation",
        "SQLite",
        "JavaScript",
        "Native Device Features"
      ]
    }
  ],
  "OtherProjects.Title": "More personal projects",
  "OtherProjects.Projects": [
    {
      "Title": "My Recipe Book",
      "Description": "Created an app displaying various cuisines, each containing a list of recipes with details on ingredients. Users can add or remove recipes from their favorites, utilizing a combination of Native Stack Navigator and Drawer Navigator for seamless navigation.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/meals",
      "Technologies": [
        "React Native",
        "JavaScript",
        "Redux",
        "Expo",
        "Native Stack Navigator",
        "Drawer Navigator"
      ]
    },
    {
      "Title": "Translate App",
      "Description": "Built a text translation app using React, enabling real-time language detection and translation through a third-party API with a clean, user-friendly interface.",
      "ghLink": "https://github.com/HaryAgni/translate-app",
      "demoLink": "https://haryagni.github.io/translate-app/",
      "Technologies": ["React", "HTML", "CSS", "JavaScript"]
    },

    {
      "Title": "Expense Tracker",
      "Description": "Created an Expense Tracker app that enables users to add, remove, edit, and fetch expenses, providing insights into their spending. It utilizes an external API built with Firebase for real-time data synchronization.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/expense-tracker",
      "Technologies": [
        "React Native",
        "JavaScript",
        "Expo",
        "Redux",
        "Firebase"
      ]
    },
    {
      "Title": "Guess My Number",
      "Description": "Developed a simple game called 'Guess My Number' where players input a number, and the app attempts to guess it. Players indicate whether their number is lower or higher than the guessed number, and once the correct guess is made, a game-over screen displays the winning number.",
      "ghLink": "https://github.com/HaryAgni/react-native-learnings/tree/main/guess-my-number",
      "Technologies": ["React Native", "JavaScript", "Expo"]
    }
  ],
  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message.",
  "Contact.Btn": "Say Hello!"
}
